import * as yup from 'yup';

export const validationSchema = yup.object().shape({
  firstName: yup
    .string()
    .required(`Обов'язкове поле`)
    .min(2, 'Мінімум 2 символи')
    .max(40, 'Максимум 40 символів')
    .matches(
      /^[ҐЄІЇЬА-ЩЮЯґєіїьа-щюя\-`'’‘“”* ]+$/,
      'Має містити українські літери, апостроф або дефіс',
    ),
  middleName: yup
    .string()
    .max(40, 'Максимум 40 символів')
    .matches(
      /^[ҐЄІЇЬА-ЩЮЯґєіїьа-щюя\-`'’‘“”* ]+$/,
      'Має містити українські літери, апостроф або дефіс',
    ),
  lastName: yup
    .string()
    .required(`Обов'язкове поле`)
    .min(2, 'Мінімум 2 символи')
    .max(40, 'Максимум 40 символів')
    .matches(
      /^[ҐЄІЇЬА-ЩЮЯґєіїьа-щюя\-`'’‘“”* ]+$/,
      'Має містити українські літери, апостроф або дефіс',
    ),
  roleName: yup.string().required(`Обов'язкове поле`),
  groupId: yup.string().required(`Обов'язкове поле`),
});
