import PageLayout from "../components/layout/PageLayout";
import CollapsePanel from "../components/ui/CollapsePanel";

const HelpPage = () => {
  return (
    <PageLayout
      title="Допомога"
    >
      <p>
      Дійсно, ніхто не відкидає, не зневажає, не уникає насолод тільки через те, що це насолоди, але лише через те, що тих, хто не вміє розумно вдаватися насолоді, осягають великі страждання. Так само як немає нікого, хто полюбивши, вважав за краще і зажадав би саме страждання тільки за те, що це страждання, а не тому, що інший раз виникають такі обставини, коли страждання і біль приносять якесь і чималу насолоду. 
      </p>
      <p>
        Якщо скористатися найпростішим прикладом, то хто з нас став би займатися якими б то не було тяжкими фізичними вправами, якщо б це не приносило з собою якоїсь користі? І хто міг би по справедливості дорікнути прагнення до насолоди, яке не несло б з собою ніяких неприємностей, або того, хто уникав би такого страждання, яке не приносило б з собою ніякої насолоди?
      </p>
      <p>
        Але ми цураємось і вважаємо, що заслуговують справедливого обурення ті, хто, піддався звабі і розбещеним спокусам, які дають їм насолоду, і без тями від пристрасті не передбачили, яких страждань і які нещастя на них чекають. Вони винні так само, як і ті, хто через душевну слабкість, тобто через бажання уникнути страждань і болю відмовляється від виконання свого обов’язку. Втім, тут дуже легко і просто провести відмінності, тому що, коли ми вільні і нам надана повна можливість вибору бажаного, коли ніщо не заважає нам робити те, що нам більше подобається, будь яку насолоду слід визнати бажаним, а будь-яке страждання огидним. Але при деяких обставинах – або на вимогу боргу, або в силу якоїсь необхідності часто доводиться забувати про насолоди і не втікати від тягарів. Тому мудрець дотримується в цьому випадку наступного принципу вибору – або, відмовляючись від задоволення, він отримує якісь інші і навіть великі насолоди, або, зазнаючи страждання, він позбавляється від більш жорстоких.
      </p>
      <p className="title">Поширені запитання</p>
      <div className="faq">
        <CollapsePanel title="Як виправити або додати інформацію до сайту?" />
        <CollapsePanel title="Як залишити відгук?" />
        <CollapsePanel title="Що ви робите з моєю особистою інформацією?" />
        <CollapsePanel title="Що робити, якщо викладач порушує мої права?" />
        <CollapsePanel title="Як вступити до студради?" />
      </div>
    </PageLayout>
  );
};

export default HelpPage;
