import PageLayout from "../components/layout/PageLayout";
import CollapsePanel from "../components/ui/CollapsePanel";

const HelpPage = () => {
  return (
    <PageLayout
      title="Допомога"
    >
      <p>
        Відповіді на поширені запитання можна знайти нижче. 
        У разі, якщо тебе цікавить щось інше або виникли проблеми при роботі з сайтом, звертайся до нас через бота зворотнього зв'язку: <a href="https://t.me/fict_robot" target="_blank">@fict_robot</a>. 
      </p>
      <p className="title">Поширені запитання</p>
      <div className="faq">
        <CollapsePanel title="Як виправити або додати інформацію до сайту?">
          <p style={{ margin: '0' }}>
            Якщо ти бачиш помилку в інформації, що розміщена на сайті або хочеш щось додати, напиши нам через бота зворотнього зв'язку: <a href="https://t.me/fict_robot" target="_blank">@fict_robot</a>.
          </p>
        </CollapsePanel>
        <CollapsePanel title="Як залишити відгук?">
          <p style={{ margin: '0' }}>
            Щоб залишити відгук, необхідно перейти на сторінку викладача і предмета, про який хочеш написати. 
            Там ти побачиш кнопку “Додати відгук”, тицьни на неї. 
            <br/><br/>
            Опиши у відгуку свій досвід, розкажи про те, як цей курс викладається, відношення викладача до студентів, корисність інформації тощо.
            Намагайся утриматись від образ та ненормативної лексики. Ми залишаємо за собою право відхилити публікацію подібних відгуків.
            <br/><br/>
            Мінімальна довжина відгуку - 100 символів, а максимальна - 4096 символів.
          </p>
        </CollapsePanel>
        <CollapsePanel title="Що ви робите з моєю особистою інформацією?">
          <p style={{ margin: '0' }}>
            Твоя особиста інформація використовується лише в межах авторизації та ідентифікації нашої системи. Усі відгуки залишаються анонімно.
            <br/><br/>
            Наш проект знаходиться у <a href="https://github.com/fictadvisor">вільному</a> доступі, тому ти можеш перевірити власноруч те, як твої дані зберігаються та відображаються.
          </p>
        </CollapsePanel>
        <CollapsePanel title="Що робити, якщо викладач порушує мої права?">
          <p style={{ margin: '0' }}>
            Якщо твої права порушують, обов'язково звертайся до студради ФІОТ. 
            <br/><br/>
            Бот зворотнього зв'язку: <a href="https://t.me/fict_robot" target="_blank">@fict_robot</a>
            <br/> 
            Голова студради ФІОТ: <a href="https://t.me/irina_kolbun" target="_blank">@irina_kolbun</a> 
          </p>
        </CollapsePanel>
        <CollapsePanel title="Як вступити до студради?">
          <p style={{ margin: '0' }}>
            Інформація про вступ до студради ФІОТ та КПІ публікується на студентських каналах Telegram приблизно на початку навчального року. 
            <br/><br/>
            Якщо у тебе є якісь ідеї та мотивація, то чекати набору не обов'язково. Просто зв'яжись із студрадою ФІОТ та розкажи про свій задум. 
            <br/><br/>
            Бот зворотнього зв'язку: <a href="https://t.me/fict_robot" target="_blank">@fict_robot</a>
          </p>
        </CollapsePanel>
      </div>
    </PageLayout>
  );
};

export default HelpPage;
