import {
  HeaderCard,
  LecturerHeaderCard,
  PollCard,
  RatingCard,
  SimpleCard,
} from "../../../components/v2/Cards";

interface OwnProps {}

type Props = OwnProps;

function Cards() {
  return (
    <div className="test-page-wrap">
      <HeaderCard
        name="Ярмоленко Єлизавета Миколаївна"
        groupName="ІК-23"
        position="Зам. староста"
      />
      <br />
      <LecturerHeaderCard
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
      />
      <br />
      <PollCard
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
        roles={["лектор", "практик", "лаборант"]}
      />
      <br />
      <RatingCard
        rating={7.5}
        name="Васильченко-Деружко Катерина Анатоліївна"
        roles={["лектор", "практик", "лаборант"]}
      />
      <br />
      <SimpleCard
        name="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
        details="3 викладачі"
      />
      <div className="test-wrap-50">
        <HeaderCard
          name="Ярмоленко Єлизавета Миколаївна"
          groupName="ІК-23"
          position="Зам. староста"
        />
        <br />
        <LecturerHeaderCard
          name="Васильченко-Деружко Катерина Анатоліївна"
          description="Вища математика. Диференціальне та інтегральне числення функцій Диференціальне та інтегральне числення функцій однієї змінноїоднієї змінноїЧастина 1. "
        />
        <br />

        <PollCard
          name="Васильченко-Деружко Катерина Анатоліївна"
          description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
          roles={["лектор", "практик", "лаборант"]}
        />
        <br />
        <RatingCard
          rating={7.5}
          name="Васильченко-Деружко Катерина Анатоліївна"
          roles={["лектор", "практик", "лаборант"]}
        />
        <br />
        <SimpleCard
          name="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
          details="3 викладачі"
        />
      </div>

      <div className="test-wrap-25">
        <HeaderCard
          name="Ярмоленко Єлизавета Миколаївна"
          groupName="ІК-23"
          position="Зам. староста"
        />
        <br />
        <LecturerHeaderCard
          name="Васильченко-Деружко Катерина Анатоліївна"
          description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
        />
        <br />
        <PollCard
          name="Васильченко-Деружко Катерина Анатоліївна"
          description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
          roles={["лектор", "практик", "лаборант"]}
        />
        <br />
        <RatingCard
          rating={7.5}
          name="Васильченко-Деружко Катерина Анатоліївна"
          roles={["лектор", "практик", "лаборант"]}
        />
        <br />
        <SimpleCard
          name="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
          details="3 викладачі"
        />
      </div>
    </div>
  );
}

export default Cards;
