import { HeaderCard, LecturerHeaderCard,PollCard } from "../../../components/v2/Cards";

interface OwnProps {}

type Props = OwnProps;

function Cards() {
  return (
    <div className="test-page-wrap">
      <HeaderCard
        name="Ярмоленко Єлизавета Миколаївна"
        groupName="ІК-23"
        position="Зам. староста"
      />

      <LecturerHeaderCard
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
      />
        <div className="test-wrap-50">
      <LecturerHeaderCard
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Диференціальне та інтегральне числення функцій Диференціальне та інтегральне числення функцій однієї змінноїоднієї змінноїЧастина 1. "
      />
      </div>
      <div 
      className="test-wrap-25">
      <LecturerHeaderCard
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
      />
       <PollCard 
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
        roles={['лектор','практик','лаборант']}
        />
      </div>
      <LecturerHeaderCard
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
      />
      <PollCard 
        name="Васильченко-Деружко Катерина Анатоліївна"
        description="Вища математика. Частина 1. Лінійна алгебра та аналітична геометрія. Диференціальне та інтегральне числення функцій однієї змінної"
        roles={['лектор','практик','лаборант']}
        />
    </div>
  );
}

export default Cards;
